#include "ioCC2530.h"

#define  LED6   P1_4
#define  LED3   P1_0
#define  LED4   P1_1
/*===================延?函?=========================*/
void Delay(unsigned int t)
{
  while(t--);
}
/*==================端口初始化函?=====================*/
void Init_Port()
{
  //?P1_0、P1_1和P1_4?置?通用I/O端口功能
  P1SEL &= ~0x13;   
  //?P1_0、P1_1和P1_4的端口??方式?置??出
  P1DIR |= 0x13;   
  LED6 = 0;
  LED3 = 0;
  LED4 = 0;
}
/*==================跑??子函?=====================*/
void LED_Running()
{
  LED3 = 1;
  Delay(50000);
  LED4 = 1;
  Delay(50000);
  LED3 = 0;
  Delay(50000);
  LED4 = 0;
  Delay(50000);
}
/*===============外部中?初始化函?==================*/
void Init_INTP()
{
  IEN2 |= 0x02;         //端口1中?使能
  P2IEN |= 0x08;        //端口P1_2外部中?使能
  PICTL |= 0x08;        //端口P1_0到P1_3下降沿触? 
  EA = 1;               //使能?中?
}
/*================外部中?1服?函?====================*/
#pragma vector = P1INT_VECTOR     //外部中?1的向量入口
__interrupt void Int1_Sevice()
{
  LED6 = ~LED6;
/*先清除引??志位，再清除端口?志位，否??不??入中?*/
  P2IFG &= ~ 0x08;        //?件清除P1_2引?的?志位
  P2IF = 0;               //?件清除P1端口?的?志位
}
/*====================主函?==========================*/
void main()
{
  Init_Port();          //初始化通用I/O端口
  Init_INTP();          //初始化外部中?
  while(1)
  {
    LED_Running();     //跑??
  }
}